{"class_name": "Functional", "config": {"name": "functional_5", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "decoder_input"}, "name": "decoder_input", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "decoder_embedding", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 10000, "output_dim": 300, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": null}, "name": "decoder_embedding", "inbound_nodes": [[["decoder_input", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 256], "dtype": "float32", "sparse": false, "ragged": false, "name": "decoder_state_in"}, "name": "decoder_state_in", "inbound_nodes": []}, {"class_name": "GRU", "config": {"name": "decoder_gru", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 256, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2, "reset_after": true}, "name": "decoder_gru", "inbound_nodes": [[["decoder_embedding", 0, 0, {}], ["decoder_state_in", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 256], "dtype": "float32", "sparse": false, "ragged": false, "name": "encoder_output"}, "name": "encoder_output", "inbound_nodes": []}, {"class_name": "Dot", "config": {"name": "dot", "trainable": true, "dtype": "float32", "axes": [2, 2], "normalize": false}, "name": "dot", "inbound_nodes": [[["decoder_gru", 0, 0, {}], ["encoder_output", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "attetion", "trainable": true, "dtype": "float32", "activation": "softmax"}, "name": "attetion", "inbound_nodes": [[["dot", 0, 0, {}]]]}, {"class_name": "Dot", "config": {"name": "context", "trainable": true, "dtype": "float32", "axes": [2, 1], "normalize": false}, "name": "context", "inbound_nodes": [[["attetion", 0, 0, {}], ["encoder_output", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concat", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concat", "inbound_nodes": [[["context", 0, 0, {}], ["decoder_gru", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "attn_out", "trainable": true, "dtype": "float32", "units": 300, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "attn_out", "inbound_nodes": [[["concat", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "decoder_output", "trainable": true, "dtype": "float32", "units": 10000, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "decoder_output", "inbound_nodes": [[["attn_out", 0, 0, {}]]]}], "input_layers": [["decoder_input", 0, 0], ["encoder_output", 0, 0], ["decoder_state_in", 0, 0]], "output_layers": [["decoder_output", 0, 0], ["decoder_gru", 0, 1]]}, "keras_version": "2.4.0", "backend": "tensorflow"}